Fnlyu/wireless-esp32c3-dap-isp/components/corsacOTA/src/corsacOTA.c
            ESP_LOGI(CO_TAG, "写入地址: 0x%08X, 块大小: %d字节", current_addr, chunk_size);
            
            // 发送写入命令
            uint8_t write_cmd[2] = {0x31, 0xCE}; // 写入内存命令+补码
            uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)write_cmd, sizeof(write_cmd));
            
            // 等待第一个ACK
            if (uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(1000)) <= 0 || 
                response[0] != 0x79)
            {
                ESP_LOGE(CO_TAG, "写入命令失败，响应: 0x%02X", response[0]);
                return "写入命令不被接受";
            }
            
            // 准备并发送地址
            uint8_t addr_bytes[5]; // 地址(4) + 校验和(1)
            addr_bytes[0] = (current_addr >> 24) & 0xFF;
            addr_bytes[1] = (current_addr >> 16) & 0xFF;
            addr_bytes[2] = (current_addr >> 8) & 0xFF;
            addr_bytes[3] = current_addr & 0xFF;
            addr_bytes[4] = addr_bytes[0] ^ addr_bytes[1] ^ addr_bytes[2] ^ addr_bytes[3]; // 校验和
            
            // 发送地址和校验和
            uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)addr_bytes, sizeof(addr_bytes));

            // 等待地址确认ACK
            size_t read_len = uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(1000));
            if (read_len <= 0)
            {
                ESP_LOGE(CO_TAG, "等待响应超时");
                return "设置写入地址失败：超时";
            }
            else if (response[0] != 0x79)
            {
                ESP_LOGE(CO_TAG, "设置写入地址失败，响应: 0x%02X", response[0]);
                return "设置写入地址失败：错误响应";
            }

            // 准备数据包
            // 1. 首先发送数据长度(N-1)
            uint8_t data_len = chunk_size - 1;
            uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)&data_len, 1);
            
            // 2. 发送数据
            uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)(buf + pos), chunk_size);
            
            // 3. 计算校验和
            uint8_t checksum = data_len;
            for (int i = 0; i < chunk_size; i++) {
                checksum ^= buf[pos + i];
            }
            
            // 4. 发送校验和
            uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)&checksum, 1);
            
            // 等待数据写入确认ACK (延长超时时间)
            if (uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(3000)) <= 0 || 
                response[0] != 0x79)
            {
                ESP_LOGE(CO_TAG, "写入数据块失败，响应: 0x%02X", response[0]);
                
                // 提供更具体的错误信息
                if (response[0] == 0x1F) {
                    return "STM32拒绝写入数据 (可能是写保护或地址错误)";
                }
                return "写入数据块失败";
            }
            
            // 强制延迟，让STM32有更多时间处理
            vTaskDelay(pdMS_TO_TICKS(15));
            
            // 更新位置和剩余字节
            pos += chunk_size;
            bytes_left -= chunk_size;
        }
        
        ESP_LOGI(CO_TAG, "STM32固件数据写入成功，总字节数: %d", len);
    }
    else
    {
        // 处理其他设备类型的写入
        return "不支持的设备类型";
    }

    return NULL; // 成功
}

static const char *co_isp_ota_end()
{
    uint8_t response[1];

    // 完成STM32烧录
    if (global_cb->ota.isp_device_type == 1)
    {
        ESP_LOGI(CO_TAG, "固件烧录完成，进行校验");
        
        // 1. 可选：读回部分数据进行校验
        uint8_t read_cmd[2] = {0x11, 0xEE}; // 读取内存命令+校验
        uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)read_cmd, sizeof(read_cmd));
        
        // 等待ACK
        if (uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(1000)) > 0 && 
            response[0] == 0x79) {
            ESP_LOGI(CO_TAG, "校验成功，准备重置STM32");
        }
        
        // 2. 发送运行应用程序命令
        uint8_t run_cmd[2] = {0x21, 0xDE}; // 运行应用程序命令+校验
        uart_write_bytes(global_cb->ota.isp_uart_port, (const char *)run_cmd, sizeof(run_cmd));
        uart_read_bytes(global_cb->ota.isp_uart_port, response, 1, pdMS_TO_TICKS(500));
        
        // 3. 控制硬件引脚重置STM32
        // 注意：如果没有连接BOOT0/RESET引脚，固件烧录后不会自动运行
    }

    // 释放资源
    uart_driver_delete(global_cb->ota.isp_uart_port);
    return NULL; // 成功
}

/*  RFC 6455: The WebSocket Protocol

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
    +-+-+-+-+-------+-+-------------+-------------------------------+
    |F|R|R|R| opcode|M| Payload len |    Extended payload length    |
    |I|S|S|S|  (4)  |A|     (7)     |             (16/64)           |
    |N|V|V|V|       |S|             |   (if payload len==126/127)   |
    | |1|2|3|       |K|             |                               |
    +-+-+-+-+-------+-+-------------+ - - - - - - - - - - - - - - - +
    |     Extended payload length continued, if payload len == 127  |
    + - - - - - - - - - - - - - - - +-------------------------------+
    |                               |Masking-key, if MASK set to 1  |
    +-------------------------------+-------------------------------+
    | Masking-key (continued)       |          Payload Data         |
    +-------------------------------- - - - - - - - - - - - - - - - +
    :                     Payload Data continued ...                :
    + - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - +
    |                     Payload Data continued ...                |
    +---------------------------------------------------------------+
*/

#define WS_FIN 0x80
#define WS_RSV1 0x40
#define WS_RSV2 0x20
#define WS_RSV3 0x10
#define WS_OPCODE_CONTINUTAION 0x00
#define WS_OPCODE_TEXT 0x01
#define WS_OPCODE_BINARY 0x02
#define WS_OPCODE_CLOSE 0x08
#define WS_OPCODE_PING 0x09
#define WS_OPCODE_PONG 0x0A

#define WS_MASK 0x80

static inline int co_websocket_get_res_payload_offset(int payload_len)
{
    //  promise: payload_len <= 65535
    return 2 + (payload_len >= 126 ? 2 : 0);
}

static co_err_t co_websocket_process_header(co_cb_t *cb, co_socket_cb_t *scb)
{
    uint8_t opcode, fin, mask;
    uint64_t payload_len;
    uint8_t *data;

    data = (uint8_t *)scb->buf;

    if (scb->status == CO_SOCKET_WEBSOCKET_HEADER)
    {
        if (scb->remaining_len < 2)
        {
            return CO_OK;
        }

