Fnlyu/wireless-esp32c3-dap-isp/components/corsacOTA/src/corsacOTA.c
    return co_ota_error_to_msg(ret);
}

// write ota data
static const char *co_ota_write(void *data, size_t len)
{
    esp_err_t ret = esp_ota_write(global_cb->ota.update_handle, data, len);
    return co_ota_error_to_msg(ret);
}

static const char *co_ota_end()
{
    esp_err_t ret = esp_ota_end(global_cb->ota.update_handle);

    if (ret != ESP_OK)
    {
        return co_ota_error_to_msg(ret);
    }

    ret = esp_ota_set_boot_partition(global_cb->ota.update_ptn);
    return co_ota_error_to_msg(ret);
}

/**
 * @brief Process OTA start request
 *
 * @param data Pointer to a string indicating the size of the firmware
 */
// static void co_ota_start(void *data) { // TODO: return value -> status
//     const char *res_msg = "deviceType=" CO_DEVICE_TYPE_NAME "&state=ready&offset=0";
//     const char *err_msg;
//     int size;

//     // may be we should ignore status...
//     // if (global_cb->ota.status != CO_OTA_INIT && global_cb->ota.status != CO_OTA_STOP) {
//     //     co_websocket_send_msg_with_code(CO_RES_INVALID_STATUS, "OTA has not started");
//     //     return;
//     // }

//     size = atoi(data);
//     if (size < 1) {
//         co_websocket_send_msg_with_code(CO_RES_INVALID_SIZE, "Invalid size");
//         return;
//     }

//     err_msg = co_ota_init(size);
//     if (err_msg != NULL) {
//         co_websocket_send_msg_with_code(CO_RES_SYSTEM_ERROR, err_msg);
//         return;
//     }

//     global_cb->ota.status = CO_OTA_LOAD;
//     global_cb->ota.total_size = size;

//     size = min(global_cb->ota.total_size / 10, 1024 * 10); // 10KB default
//     if (size == 0) {
//         size = 1; // Firmware too small...
//     }

//     global_cb->ota.chunk_size = size;
//     global_cb->ota.offset = 0;
//     global_cb->ota.last_index_offset = 0;

//     co_websocket_send_msg_with_code(CO_RES_SUCCESS, res_msg);
// }

static void co_ota_start(void *data)
{
    char op_field[10 + 1] = {0};
    char data_field[10 + 1] = {0};
    char target_field[10 + 1] = {0};
    char options_field[50 + 1] = {0};
    const char *res_msg;
    const char *err_msg = NULL;
    int size;

    // 解析参数
    if (co_parse_request_text((const char *)data, op_field, data_field, target_field, options_field) != CO_OK)
    {
        co_websocket_send_msg_with_code(CO_RES_INVALID_ARG, "解析参数失败");
        return;
    }

    // 提取固件大小
    size = atoi(data_field);
    if (size < 1)
    {
        co_websocket_send_msg_with_code(CO_RES_INVALID_SIZE, "无效的固件大小");
        return;
    }

    // 检查是否是ISP升级模式
    if (strcmp(target_field, "isp") == 0)
    {
        // 解析ISP选项 (格式: type=1&baudrate=115200)
        uint8_t device_type = 1;    // 默认
        uint32_t baudrate = 115200; // 默认

        char *type_str = strstr(options_field, "type=");
        if (type_str)
        {
            device_type = atoi(type_str + 5);
        }

        char *baud_str = strstr(options_field, "baudrate=");
        if (baud_str)
        {
            baudrate = atoi(baud_str + 9);
        }

        // 进入ISP升级模式
        global_cb->ota.is_isp_mode = true;
        err_msg = co_isp_ota_init(device_type, size, baudrate);
        res_msg = "deviceType=ISP&state=ready&offset=0";
    }
    else
    {
        // 正常ESP自身OTA升级
        global_cb->ota.is_isp_mode = false;
        err_msg = co_ota_init(size);
        res_msg = "deviceType=" CO_DEVICE_TYPE_NAME "&state=ready&offset=0";
    }

    if (err_msg != NULL)
    {
        co_websocket_send_msg_with_code(CO_RES_SYSTEM_ERROR, err_msg);
        return;
    }

    global_cb->ota.status = CO_OTA_LOAD;
    global_cb->ota.total_size = size;
    global_cb->ota.chunk_size = min(global_cb->ota.total_size / 10, 1024 * 10);
    global_cb->ota.offset = 0;
    global_cb->ota.last_index_offset = 0;

    co_websocket_send_msg_with_code(CO_RES_SUCCESS, res_msg);
}

static void co_ota_stop(void *data)
{
    if (global_cb->ota.status != CO_OTA_FATAL_ERROR)
    {
        memset(&global_cb->ota, 0, sizeof(global_cb->ota));
        global_cb->ota.status = CO_OTA_STOP;
        co_websocket_send_msg_with_code(CO_RES_SUCCESS, "");
    }
    else
    {
        co_websocket_send_msg_with_code(CO_RES_SYSTEM_ERROR, "Fatal error");
    }
}

// static void co_websocket_process_binary(uint8_t *data, size_t len) {
//     char res[32]; // state=ready&offset=2147483647
//     const char *err_msg;
//     bool is_done;

//     if (global_cb->ota.status == CO_OTA_LOAD) {
//         global_cb->ota.offset += (int)len;
//         is_done = global_cb->ota.total_size == global_cb->ota.offset;
//         if (is_done) {
//             // If everything is fine, then we will restart chip afterwards, which does not require the use of the status
//             global_cb->ota.status = CO_OTA_INIT;
//         }

//         err_msg = co_ota_write(data, len);
//         if (err_msg != NULL) {
//             memset(&global_cb->ota, 0, sizeof(global_cb->ota));
//             global_cb->ota.status = CO_OTA_STOP;
//             co_websocket_send_msg_with_code(CO_RES_SYSTEM_ERROR, err_msg);
//             return;
//         }

//         // response
//         if (!is_done && global_cb->ota.offset - global_cb->ota.last_index_offset < global_cb->ota.chunk_size) {
//             return;
//         }

//         global_cb->ota.last_index_offset = global_cb->ota.offset;

//         snprintf(res, 32, "state=%s&offset=%d", is_done ? "done" : "ready", global_cb->ota.offset);

//         if (is_done) {
//             err_msg = co_ota_end();
//             if (err_msg != NULL) {
//                 co_websocket_send_msg_with_code(CO_RES_SYSTEM_ERROR, err_msg);
//                 return;
//             }

//             co_websocket_send_msg_with_code(CO_RES_SUCCESS, res);

//             ESP_LOGD(CO_TAG, "prepare to restart");
//             vTaskDelay(pdMS_TO_TICKS(5000));
//             co_hardware_restart();
//         }

//         co_websocket_send_msg_with_code(CO_RES_SUCCESS, res);
//     } else if (global_cb->ota.status != CO_OTA_STOP) {
//         // skip the rest of the frame when a stop command is received
//         co_websocket_send_msg_with_code(CO_RES_INVALID_STATUS, "OTA has not started");
//     }
// }

static void co_websocket_process_binary(uint8_t *data, size_t len)
{
    char res[32];
    const char *err_msg;
    bool is_done;

