Fnlyu/wireless-esp32c3-dap-isp/components/corsacOTA/src/corsacOTA.c
    if (global_cb->ota.status == CO_OTA_LOAD)
    {
        global_cb->ota.offset += (int)len;
        is_done = global_cb->ota.total_size == global_cb->ota.offset;

        if (is_done)
        {
            global_cb->ota.status = CO_OTA_INIT;
        }

        // 根据模式选择写入方式
        if (global_cb->ota.is_isp_mode)
        {
            err_msg = co_isp_ota_write(data, len);
        }
        else
        {
            err_msg = co_ota_write(data, len);
        }

        if (err_msg != NULL)
        {
            memset(&global_cb->ota, 0, sizeof(global_cb->ota));
            global_cb->ota.status = CO_OTA_STOP;
            co_websocket_send_msg_with_code(CO_RES_SYSTEM_ERROR, err_msg);
            return;
        }

        // 响应分块处理
        if (!is_done && global_cb->ota.offset - global_cb->ota.last_index_offset < global_cb->ota.chunk_size)
        {
            return;
        }

        global_cb->ota.last_index_offset = global_cb->ota.offset;
        snprintf(res, 32, "state=%s&offset=%d", is_done ? "done" : "ready", global_cb->ota.offset);

        if (is_done)
        {
            // 结束OTA流程
            if (global_cb->ota.is_isp_mode)
            {
                err_msg = co_isp_ota_end();
            }
            else
            {
                err_msg = co_ota_end();
            }

            if (err_msg != NULL)
            {
                co_websocket_send_msg_with_code(CO_RES_SYSTEM_ERROR, err_msg);
                return;
            }

            co_websocket_send_msg_with_code(CO_RES_SUCCESS, res);

            // 仅当升级ESP自身时才需要重启
            if (!global_cb->ota.is_isp_mode)
            {
                ESP_LOGD(CO_TAG, "prepare to restart");
                vTaskDelay(pdMS_TO_TICKS(5000));
                co_hardware_restart();
            }
        }

        co_websocket_send_msg_with_code(CO_RES_SUCCESS, res);
    }
    else if (global_cb->ota.status != CO_OTA_STOP)
    {
        co_websocket_send_msg_with_code(CO_RES_INVALID_STATUS, "OTA has not started");
    }
}

static void co_websocket_process_text(uint8_t *data, size_t len)
{
    char op_field[10 + 1] = {0};
    char data_field[10 + 1] = {0};
    char target_field[10 + 1] = {0};
    char options_field[50 + 1] = {0};
    char *text;
    co_process_fn_t fn;

    // Note that the text may not have a terminator
    text = strndup((char *)data, len);
    if (text == NULL)
    {
        ESP_LOGE(CO_TAG, "内存分配失败");
        goto clean;
    }

    ESP_LOGI(CO_TAG, "收到请求: %s", text);

    if (co_parse_request_text(text, op_field, data_field, target_field, options_field) != CO_OK)
    {
        co_websocket_send_msg_with_code(CO_RES_INVALID_ARG, "解析参数失败");
        goto clean;
    }

    if ((fn = co_get_process_entry(op_field)) == NULL)
    {
        co_websocket_send_msg_with_code(CO_RES_INVALID_ARG, "无效的操作");
        goto clean;
    }

    // 调用处理函数，传递完整的原始文本
    fn(text);

clean:
    free(text);
}

// send pong response
// TODO: too long ping frame
static void co_websocket_process_ping(co_cb_t *cb, co_socket_cb_t *scb)
{
    int len;

    // control frame max payload length: 125 -> 0 byte extended length
    len = 2 + scb->wcb.payload_len + (scb->wcb.MASK ? 4 : 0);

    scb->buf[0] = WS_FIN | WS_OPCODE_PONG;

    send(scb->fd, scb->buf, len, 0);
}

// close handshake
// TODO: array
static void co_websocket_process_close(co_cb_t *cb, co_socket_cb_t *scb)
{
    uint8_t buf[4];
    uint8_t *p = buf;

    *p++ = WS_FIN | WS_OPCODE_CLOSE;
    *p++ = 0x02; // 2 byte status code
    // normal closure
    *p++ = 0x03;
    *p = 0xe8;

    send(scb->fd, buf, 4, 0);
}

static inline CO_INLINE uint32_t co_rotr32(uint32_t n, unsigned int c)
{
    const unsigned int mask = (CHAR_BIT * sizeof(n) - 1);
    c &= mask;
    return (n >> c) | (n << ((-c) & mask));
}

/**
 * @brief Quick calculation WebSocket. The process of calculating the mask is one of the performance bottlenecks
 * of the entire websocket. The performance between the optimized version and the version without mask is not significant.
 *
 * We assume: the natural machine word length is 4byte (32bits) and the endianness is little-endian
 * For xtensa: single fetch: 4 byte(32bit)
 *
 * @param data data buffer ptr
 * @param mask websocket mask. Little-endian 32bis mask.
 * @param len data length
 */
void co_websocket_fast_mask(uint8_t *data, uint32_t mask, size_t len)
{
    uint32_t new_mask;
    int align_len;
    size_t i;

    const uint8_t *p_mask = (uint8_t *)&mask;

    unsigned long int dst = (long int)data;

    if (len >= 8)
    {
        // copy just a few bytes to make dst aligned.
        align_len = (-dst) % 4;
        len -= align_len;

        for (i = 0; i < align_len; i++)
        {
            data[i] ^= p_mask[i];
        }

        // use the new mask on the aligned address
        switch (align_len)
        {
        case 1:
            new_mask = co_rotr32(mask, 8U);
            break;
        case 2:
            new_mask = co_rotr32(mask, 16U);
            break;
        case 3:
            new_mask = co_rotr32(mask, 24U);
            break;
        default: // 0
            new_mask = mask;
            break;
        }

        p_mask = (uint8_t *)&new_mask;

        dst += align_len;

        for (i = 0; i < len / 4; i++)
        {
            *((uint32_t *)dst) ^= new_mask;
            dst += 4;
        }

        len %= 4;
    }

    // There are just a few bytes to process
    for (i = 0; i < len; i++)
    {
        *((uint8_t *)dst) ^= p_mask[i % 4];
        dst += 1;
    }
}

static inline uint32_t co_websocket_get_new_mask(uint32_t mask, size_t len)
{
    switch (len & 0b11)
    {
    case 1:
        return co_rotr32(mask, 8U);
    case 2:
        return co_rotr32(mask, 16U);
    case 3:
        return co_rotr32(mask, 24U);
    default:
        return mask;
    }
}

/**
 * @brief Process websocket payload
 *
 * @param cb corsacOTA control block
 * @param scb corsacOTA socket control block
 * @return co_err_t
 * - CO_OK: Successful processing of all payloads
 * - CO_ERROR_IO_PENDING: There are still new frames to be processed
 */
static co_err_t co_websocket_process_payload(co_cb_t *cb, co_socket_cb_t *scb)
{
    int len, new_len;
    uint8_t *data;
    uint32_t mask;

    data = (uint8_t *)scb->buf + scb->read_len;
    // May be possible to read the complete frame and maybe a new frame rate afterwards
    len = min(scb->remaining_len - scb->read_len, scb->wcb.payload_len);

