Fnlyu/wireless-esp32c3-dap-isp/components/corsacOTA/src/corsacOTA.c
static void co_http_error_400_response(co_cb_t *cb, co_socket_cb_t *scb)
{
    const char *error = "HTTP/1.1 400 Bad Request\r\n\r\n";
    send(scb->fd, error, strlen(error), 0);
}

#define WS_GUID "258EAFA5-E914-47DA-95CA-C5AB0DC85B11"

int co_sha1(const unsigned char *src, size_t src_len, unsigned char *dst)
{
    return mbedtls_sha1_ret(src, src_len, dst);
}

int co_base64_encode(unsigned char *dst, size_t dst_len, size_t *written_len, unsigned char *src, size_t src_len)
{
    return mbedtls_base64_encode(dst, dst_len, written_len, src, src_len);
}

static esp_err_t co_websocket_create_accept_key(char *dst, size_t dst_len, const char *client_key)
{
    uint8_t sha1buf[20], key_src[60];

    memcpy(key_src, client_key, 24);
    memcpy(key_src + 24, WS_GUID, 36);

    if (co_sha1(key_src, sizeof(key_src), sha1buf) != 0)
    {
        return ESP_FAIL;
    }

    size_t base64_encode_len;
    if (co_base64_encode((unsigned char *)dst, dst_len, &base64_encode_len, sha1buf, sizeof(sha1buf)) != 0)
    {
        return ESP_FAIL;
    }

    // add terminator
    dst[base64_encode_len] = '\0';

    return ESP_OK;
}

static esp_err_t co_websocket_handshake_send_key(int fd, const char *client_key)
{
    char res_header[256], accept_key[29];
    int res_header_length;

    if (co_websocket_create_accept_key(accept_key, sizeof(accept_key), client_key) != ESP_OK)
    {
        ESP_LOGE(CO_TAG, LOG_FMT("fail to create accept key"));
        return ESP_FAIL;
    }

    snprintf(res_header, sizeof(res_header),
             "HTTP/1.1 101 Switching Protocols\r\n"
             "Server: corsacOTA server\r\n"
             "Upgrade: websocket\r\n"
             "Connection: Upgrade\r\n"
             "Sec-WebSocket-Accept: %s\r\n"
             "\r\n",
             accept_key);

    res_header_length = strlen(res_header);
    send(fd, res_header, res_header_length, 0);

    return ESP_OK;
}

static esp_err_t co_websocket_handshake_process(co_cb_t *cb, co_socket_cb_t *scb)
{
    if (scb->remaining_len == 0)
    {
        memset(scb->buf, 0, CONFIG_CO_SOCKET_BUFFER_SIZE);
    }

    int offset = scb->remaining_len;
    int fd = scb->fd;

    int ret = recv(fd, scb->buf + offset, CONFIG_CO_SOCKET_BUFFER_SIZE - offset, 0);
    if (ret <= 0)
    {
        co_http_error_400_response(cb, scb);
        return ESP_FAIL;
    }

    scb->remaining_len += ret;

    // Already received the entire http header?
    if (scb->remaining_len < 4 || memcmp(scb->buf + scb->remaining_len - 4, "\r\n\r\n", 4) != 0)
    {
        return ESP_OK; // Not yet received
    }

    const char *header_start = scb->buf, *header_end = scb->buf + scb->remaining_len - 1;
    const char *ws_key_start, *ws_key_end;

    if (co_http_header_find_field_value(header_start, header_end, "Upgrade", "websocket") == NULL ||
        co_http_header_find_field_value(header_start, header_end, "Connection", "Upgrade") == NULL ||
        (ws_key_start = co_http_header_find_field_value(header_start, header_end, "Sec-WebSocket-Key", NULL)) == NULL)
    {
        co_http_error_400_response(cb, scb);
        return ESP_FAIL;
    }

    /* example:
     Sec-WebSocket-Key: c2REMVVpRXJRQWJ0Q1dKeQ==\r\n
                       |
                    ws_key_start
    */

    // skip the extra blank
    for (; *ws_key_start == ' '; ws_key_start++)
    {
        ;
    }

    // find the end of ws key
    for (ws_key_end = ws_key_start; *ws_key_end != '\r' && *ws_key_end != ' '; ws_key_end++)
    {
        ;
    }

    /* example:
     Sec-WebSocket-Key: c2REMVVpRXJRQWJ0Q1dKeQ==\r\n
                        |                       ||
                    ws_key_start            ws_key_end
    */
    if (ws_key_end - ws_key_start != 24)
    {
        co_http_error_400_response(cb, scb);
        return ESP_FAIL;
    }

    if (co_websocket_handshake_send_key(scb->fd, ws_key_start) != ESP_OK)
    {
        co_http_error_400_response(cb, scb);
        return ESP_FAIL;
    }

    ESP_LOGD(CO_TAG, "websocket handshake success");

    cb->websocket = scb;
    scb->status = CO_SOCKET_WEBSOCKET_HEADER;
    scb->remaining_len = 0;

    memset(scb->buf, 0, CONFIG_CO_SOCKET_BUFFER_SIZE);

    return ESP_OK;
}

static esp_err_t co_socket_data_process(co_cb_t *cb, co_socket_cb_t *scb)
{
    if (cb == NULL || scb == NULL)
    {
        return ESP_ERR_INVALID_ARG;
    }

    switch (scb->status)
    {
    case CO_SOCKET_ACCEPT:
        ESP_LOGW(CO_TAG, LOG_FMT("This state should not occur"));
        return ESP_FAIL; //// TODO: remove this?
    case CO_SOCKET_HANDSHAKE:
        return co_websocket_handshake_process(cb, scb);
    case CO_SOCKET_WEBSOCKET_HEADER:
    case CO_SOCKET_WEBSOCKET_EXTEND_LENGTH:
    case CO_SOCKET_WEBSOCKET_MASK:
    case CO_SOCKET_WEBSOCKET_PAYLOAD:
        return co_websocket_process(cb, scb);
    default:
        ESP_LOGW(CO_TAG, LOG_FMT("This state should not occur"));
        return ESP_OK;
    }
}

static esp_err_t co_socket_list_alloc(co_cb_t *cb)
{
    if (cb == NULL)
    {
        return ESP_ERR_INVALID_ARG;
    }

    int i;
    cb->socket_list = calloc(cb->max_listen_num, sizeof(co_socket_cb_t *)); // pointer list
    if (cb->socket_list == NULL)
    {
        return ESP_ERR_NO_MEM;
    }

    for (i = 0; i < cb->max_listen_num; i++)
    {
        if ((cb->socket_list[i] = calloc(1, sizeof(struct co_socket_cb))) == NULL)
        {
            goto fail;
        }
    }
    return ESP_OK;

fail:
    for (i = 0; i < cb->max_listen_num; i++)
    {
        if (cb->socket_list[i] != NULL)
        {
            free(cb->socket_list[i]);
        }
    }
    free(cb->socket_list);
    cb->socket_list = NULL;
    return ESP_ERR_NO_MEM;
}

/**
 * @brief add a new fd to socket list
 *
 * @param cb corsacOTA control block
 * @param fd socket file descriptor
 * @return err_t
 */
static err_t co_socket_list_insert(co_cb_t *cb, int fd)
{
    int i;
    for (i = 0; i < cb->max_listen_num; i++)
    {
        if (cb->socket_list[i]->fd == -1)
        {
            cb->socket_list[i]->fd = fd;
            return ESP_OK;
        }
    }

