Fnlyu/wireless-esp32c3-dap-isp/components/corsacOTA/src/corsacOTA.c
    return ESP_FAIL;
}

/**
 * @brief Iterate to get each socket control blck in socket list
 *
 * @param cb corsacOTA control block
 * @param begin The fd obtained in the previous iteration. Should be `NULL` for the initial iteration.
 * @param ignore_closing If true, all fd's that are closing will be ignored.
 * @return int The current socket control block obtained by the iterator, or `NULL` for not found.
 */
static co_socket_cb_t *co_socket_list_iterate(co_cb_t *cb, co_socket_cb_t *begin, bool ignore_closing)
{
    int start_index = 0;
    int i;

    if (begin != NULL)
    {
        for (i = 0; i < cb->max_listen_num; i++)
        {
            if (cb->socket_list[i] == begin)
            {
                start_index = i + 1;
                break;
            }
        }
    }

    for (i = start_index; i < cb->max_listen_num; i++)
    {
        if (cb->socket_list[i]->fd != -1)
        {
            if (ignore_closing && cb->socket_list[i]->status == CO_SOCKET_CLOSING)
            {
                continue;
            }
            return cb->socket_list[i];
        }
    }

    return NULL;
}

/**
 * @brief Invalidate all sockets in the list in the accept stage
 *
 * @param cb corsacOTA cotrol block pointer
 */
static void co_socket_list_init(co_cb_t *cb)
{
    int i;
    for (i = 0; i < cb->max_listen_num; i++)
    {
        cb->socket_list[i]->fd = -1;
        cb->socket_list[i]->status = CO_SOCKET_ACCEPT;
    }
}

static co_cb_t *co_control_block_create(co_config_t *config)
{
    co_cb_t *cb = calloc(1, sizeof(co_cb_t));
    if (cb == NULL)
    {
        return NULL;
    }

    cb->recv_data = malloc(CONFIG_CO_WS_TEXT_BUFFER_SIZE + 1);
    if (cb->recv_data == NULL)
    {
        free(cb);
        return NULL;
    }

    // setting
    cb->max_listen_num = config->max_listen_num;
    cb->wait_timeout_sec = config->wait_timeout_sec;
    cb->wait_timeout_usec = config->wait_timeout_usec;

    cb->listen_fd = -1;
    cb->websocket_fd = -1;

    cb->recv_data_offset = 0;

    if (co_socket_list_alloc(cb) != ESP_OK)
    {
        free(cb);
        return NULL;
    }
    return cb;
}

static void co_free_all(co_cb_t *cb)
{
    if (cb == NULL)
    {
        return;
    }

    int i;
    if (cb->socket_list != NULL)
    {
        for (i = 0; i < cb->max_listen_num; i++)
        {
            if (cb->socket_list[i] != NULL)
            {
                if (cb->socket_list[i]->fd != -1)
                {
                    close(cb->socket_list[i]->fd);
                }
                free(cb->socket_list[i]->buf);
            }
            free(cb->socket_list[i]);
        }
        free(cb->socket_list);
    }

    if (cb->listen_fd != -1)
    {
        close(cb->listen_fd);
    }

    free(cb->recv_data);

    free(cb);
    global_cb = NULL;
}

/**
 * @brief free the specified socket control block
 *
 * @param scb Socket control block included in cb
 */
static void co_socket_buf_free(co_socket_cb_t *scb)
{
    free(scb->buf);
    scb->buf = NULL;
    scb->remaining_len = 0;
    scb->read_len = 0;
}

static int co_socket_init(co_cb_t *cb, co_config_t *config)
{
#if (defined CONFIG_LWIP_IPV6) && (CONFIG_LWIP_IPV6 == 1)
    int fd = socket(PF_INET6, SOCK_STREAM, 0);
#else
    int fd = socket(PF_INET, SOCK_STREAM, 0);
#endif // (defined CONFIG_LWIP_IPV6) && (CONFIG_LWIP_IPV6 == 1)
    if (fd < 0)
    {
        ESP_LOGE(CO_TAG, LOG_FMT("error in socket (%d)"), errno);
        return ESP_FAIL;
    }

#if (defined CONFIG_LWIP_IPV6) && (CONFIG_LWIP_IPV6 == 1)
    struct in6_addr inaddr_any = IN6ADDR_ANY_INIT;
    struct sockaddr_in6 serv_addr = {
        .sin6_family = PF_INET6,
        .sin6_addr = inaddr_any,
        .sin6_port = htons(config->listen_port),
    };
#else
    struct sockaddr_in serv_addr = {
        .sin_family = PF_INET,
        .sin_addr = {
            .s_addr = htonl(INADDR_ANY)},
        .sin_port = htons(config->listen_port),
    };
#endif // (defined CONFIG_LWIP_IPV6) && (CONFIG_LWIP_IPV6 == 1)
    int ret = bind(fd, (struct sockaddr *)&serv_addr, sizeof(serv_addr));
    if (ret < 0)
    {
        ESP_LOGE(CO_TAG, LOG_FMT("error in bind (%d)"), errno);
        close(fd);
        return ESP_FAIL;
    }

    ret = listen(fd, config->max_listen_num);
    if (ret < 0)
    {
        ESP_LOGE(CO_TAG, LOG_FMT("error in listen (%d)"), errno);
        close(fd);
        return ESP_FAIL;
    }

    cb->listen_fd = fd;
    return ESP_OK;
}

/**
 * @brief Accept a new connection, set the timeout, insert it into socket list,
 *        allocate the memory needed for the connection
 * @param cb corsacOTA control block
 * @return esp_err_t
 * - ESP_OK accept successfully
 */
static esp_err_t co_socket_accept(co_cb_t *cb)
{
    struct sockaddr_in addr_from;
    socklen_t addr_from_len = sizeof(addr_from);
    int new_fd = accept(cb->listen_fd, (struct sockaddr *)&addr_from, &addr_from_len);
    if (new_fd < 0)
    {
        ESP_LOGW(CO_TAG, LOG_FMT("error in accept (%d)"), errno);
        return ESP_FAIL;
    }

    struct timeval tv;
    // set recv timrout
    tv.tv_sec = cb->wait_timeout_usec;
    tv.tv_usec = cb->wait_timeout_usec;
    setsockopt(new_fd, SOL_SOCKET, SO_RCVTIMEO, (const char *)&tv, sizeof(tv));

    // set send timeout
    tv.tv_sec = cb->wait_timeout_usec;
    tv.tv_usec = cb->wait_timeout_usec;
    setsockopt(new_fd, SOL_SOCKET, SO_SNDTIMEO, (const char *)&tv, sizeof(tv));

    // try to add to the socket list
    if (co_socket_list_insert(cb, new_fd) != ESP_OK)
    {
        ESP_LOGW(CO_TAG, LOG_FMT("Unable to add to socket list"));
        close(new_fd);
        return ESP_FAIL;
    }

    // create new buffer
    int i;
    co_socket_cb_t *scb = NULL;
    for (i = 0; i < cb->max_listen_num; i++)
    { // find the corresponding SCB
        if (cb->socket_list[i]->fd == new_fd)
        {
            scb = cb->socket_list[i];
            break;
        }
    }
    assert(scb != NULL);
    scb->buf = malloc(CONFIG_CO_SOCKET_BUFFER_SIZE + 1);
    scb->remaining_len = 0;
    if (scb->buf == NULL)
    {
        close(new_fd);
        return ESP_ERR_NO_MEM;
    }

    scb->status = CO_SOCKET_HANDSHAKE;

    return ESP_OK;
}

static void co_socket_set_non_block(int fd)
{
    int flag;
    if ((flag = fcntl(fd, F_GETFL, 0)) < 0)
    {
        return;
    }

    flag |= O_NONBLOCK;
    fcntl(fd, F_SETFL, flag);
}

/**
 * @brief Close the socket and set its state
 *
 * @param cb corsacOTA control block
 * @param scb corsacOTA socket control block
 */
static void co_socket_close(co_cb_t *cb, co_socket_cb_t *scb)
{
    cb->closing_num++;
    scb->status = CO_SOCKET_CLOSING;

